InformationRegisters/ТелеграмИнвайты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмИнвайты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДобавитьРазрешения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УбратьРазрешения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КтоВыдал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмЧатыПользователи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КтоАктивировал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмЧатыПользователи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстИнвайта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Инвайт</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграмИнвайты/Ext/ManagerModule.bsl
Функция СгенерироватьНовыйИнвайтПользователя(МассивПараметровВыдать, МассивПараметровЗабрать, ЧатПользователь = Неопределено) Экспорт
		
	МенеджерЗаписи = РегистрыСведений.ТелеграмИнвайты.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Инвайт = Новый УникальныйИдентификатор;
	МенеджерЗаписи.ДобавитьРазрешения = Новый ХранилищеЗначения(МассивПараметровВыдать, Новый СжатиеДанных(9));
	МенеджерЗаписи.УбратьРазрешения = Новый ХранилищеЗначения(МассивПараметровЗабрать, Новый СжатиеДанных(9));
	МенеджерЗаписи.ДатаВыдачи = ТекущаяДата();
	МенеджерЗаписи.ТекстИнвайта = "/invite " + МенеджерЗаписи.Инвайт;
	МенеджерЗаписи.КтоВыдал = ?(ЧатПользователь = Неопределено, Пользователи.ТекущийПользователь(),ЧатПользователь);
	
	МенеджерЗаписи.Записать();
	
	
	Возврат МенеджерЗаписи.ТекстИнвайта;
	
КонецФункции

Процедура ЗаполнитьМассивыРазрешенийИзЗаписиИнвайта(МассивПараметровВыдать, МассивПараметровЗабрать, УникальныйИдентификатор) Экспорт
		
	МенеджерЗаписи = РегистрыСведений.ТелеграмИнвайты.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Инвайт = УникальныйИдентификатор;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		
		МассивПараметровВыдать = МенеджерЗаписи.ДобавитьРазрешения.Получить();	
		МассивПараметровЗабрать = МенеджерЗаписи.УбратьРазрешения.Получить();
		
	КонецЕсли;
	
		
КонецПроцедуры

Функция ПроверитьДоступностьИнвайта(УникальныйИдентификатор) Экспорт
	
	Доступен = Ложь;	
	
	МенеджерЗаписи = РегистрыСведений.ТелеграмИнвайты.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Инвайт = УникальныйИдентификатор;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Доступен = НЕ МенеджерЗаписи.Активирован;		
	КонецЕсли;
	
	Возврат Доступен;
		
КонецФункции

Функция ПроизвестиПопыткуАктивироватьИнвайт(Активирован, ЧатПользователь, УникальныйИдентификатор, МассивПараметровВыдать, МассивПараметровЗабрать) Экспорт
	
	Активирован = Ложь;
	
	МенеджерЗаписи = РегистрыСведений.ТелеграмИнвайты.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Инвайт = УникальныйИдентификатор;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		
		Если НЕ МенеджерЗаписи.Активирован Тогда
			МенеджерЗаписи.Активирован = Истина;
			МенеджерЗаписи.ДатаАктивации = ТекущаяДата();
			МенеджерЗаписи.КтоАктивировал = ЧатПользователь;
			
			МенеджерЗаписи.Записать();
			
			Активирован = Истина;
			МассивПараметровВыдать = МенеджерЗаписи.ДобавитьРазрешения.Получить();	
			МассивПараметровЗабрать = МенеджерЗаписи.УбратьРазрешения.Получить();
			
		КонецЕсли;
		
	КонецЕсли;
			
КонецФункции
